validation/stefan/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Temperature: uniform 392 K (just above the solidification band), cold
    wall at 353 K, all other walls adiabatic.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 392;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    coldWall
    {
        type            fixedValue;
        value           uniform 353;
    }

    hotEnd
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
